zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_exti.h
/**
  ******************************************************************************
  * @file    stm32mp2xx_hal_exti.h
  * @author  MCD Application Team
  * @brief   Header file of EXTI HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32MP2xx_HAL_EXTI_H
#define STM32MP2xx_HAL_EXTI_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx_hal_def.h"

/** @addtogroup STM32MP2xx_HAL_Driver
  * @{
  */

/** @defgroup EXTI EXTI
  * @brief EXTI HAL module driver
  * @{
  */

/* Exported types ------------------------------------------------------------*/

/** @defgroup EXTI_Exported_Types EXTI Exported Types
  * @{
  */
/**
  * @brief  EXTI callback ID definition
  */
typedef enum
{
  HAL_EXTI_COMMON_CB_ID          = 0x00U,
  HAL_EXTI_RISING_CB_ID          = 0x01U,   /*!<  Exti rising callback ID */
  HAL_EXTI_FALLING_CB_ID         = 0x02U,   /*!<  Exti falling callback ID */
} EXTI_CallbackIDTypeDef;


/**
  * @brief  EXTI Handle structure definition
  */
typedef struct
{
  EXTI_TypeDef  *Instance;          /*!< Register base address */
  uint32_t Line;                    /*!<  Exti line number */
  void (* RisingCallback)(void);    /*!<  Exti rising callback */
  void (* FallingCallback)(void);   /*!<  Exti falling callback */
} EXTI_HandleTypeDef;

/**
  * @brief  EXTI Configuration structure definition
  */
typedef struct
{
  uint32_t Line;      /*!< The Exti line to be configured. This parameter
                           can be a value of @ref EXTI1_Line or EXTI2_Line */
  uint32_t Mode;      /*!< The Exit Mode to be configured for a core.
                           This parameter can be a combination of @ref EXTI_Mode */
  uint32_t Trigger;   /*!< The Exti Trigger to be configured. This parameter
                           can be a value of @ref EXTI_Trigger */
  uint32_t GPIOSel;   /*!< The Exti GPIO multiplexer selection to be configured.
                           This parameter is only possible for line 0 to 15. It
                           can be a value of @ref EXTI_GPIOSel */
} EXTI_ConfigTypeDef;

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup EXTI_Exported_Constants EXTI Exported Constants
  * @{
  */

/** @defgroup EXTI1_Line  EXTI1 Line
  * @{
  */
#if ! defined (STM32MP2XX_ASSY3_1_0 )
/* GPIO */
#define EXTI1_LINE_0                         (EXTI_EXTI1|EXTI_GPIO     | EXTI_EVENT | 0x00u)
#define EXTI1_LINE_1                         (EXTI_EXTI1|EXTI_GPIO     | EXTI_EVENT | 0x01u)
#define EXTI1_LINE_2                         (EXTI_EXTI1|EXTI_GPIO     | EXTI_EVENT | 0x02u)
#define EXTI1_LINE_3                         (EXTI_EXTI1|EXTI_GPIO     | EXTI_EVENT | 0x03u)
#define EXTI1_LINE_4                         (EXTI_EXTI1|EXTI_GPIO     | EXTI_EVENT | 0x04u)
#define EXTI1_LINE_5                         (EXTI_EXTI1|EXTI_GPIO     | EXTI_EVENT | 0x05u)
#define EXTI1_LINE_6                         (EXTI_EXTI1|EXTI_GPIO     | EXTI_EVENT | 0x06u)
#define EXTI1_LINE_7                         (EXTI_EXTI1|EXTI_GPIO     | EXTI_EVENT | 0x07u)
#define EXTI1_LINE_8                         (EXTI_EXTI1|EXTI_GPIO     | EXTI_EVENT | 0x08u)
#define EXTI1_LINE_9                         (EXTI_EXTI1|EXTI_GPIO     | EXTI_EVENT | 0x09u)
#define EXTI1_LINE_10                        (EXTI_EXTI1|EXTI_GPIO     | EXTI_EVENT | 0x0Au)
#define EXTI1_LINE_11                        (EXTI_EXTI1|EXTI_GPIO     | EXTI_EVENT | 0x0Bu)
#define EXTI1_LINE_12                        (EXTI_EXTI1|EXTI_GPIO     | EXTI_EVENT | 0x0Cu)
#define EXTI1_LINE_13                        (EXTI_EXTI1|EXTI_GPIO     | EXTI_EVENT | 0x0Du)
#define EXTI1_LINE_14                        (EXTI_EXTI1|EXTI_GPIO     | EXTI_EVENT | 0x0Eu)
#define EXTI1_LINE_15                        (EXTI_EXTI1|EXTI_GPIO     | EXTI_EVENT | 0x0Fu)
#else   /* !defined (STM32MP2XX_ASSY3_1_0 ) */
#define EXTI1_LINE_0                         (EXTI_EXTI1|EXTI_RESERVED |              0x00u)
#define EXTI1_LINE_1                         (EXTI_EXTI1|EXTI_RESERVED |              0x01u)
#define EXTI1_LINE_2                         (EXTI_EXTI1|EXTI_RESERVED |              0x02u)
#define EXTI1_LINE_3                         (EXTI_EXTI1|EXTI_RESERVED |              0x03u)
#define EXTI1_LINE_4                         (EXTI_EXTI1|EXTI_RESERVED |              0x04u)
#define EXTI1_LINE_5                         (EXTI_EXTI1|EXTI_RESERVED |              0x05u)
#define EXTI1_LINE_6                         (EXTI_EXTI1|EXTI_RESERVED |              0x06u)
#define EXTI1_LINE_7                         (EXTI_EXTI1|EXTI_RESERVED |              0x07u)
#define EXTI1_LINE_8                         (EXTI_EXTI1|EXTI_RESERVED |              0x08u)
#define EXTI1_LINE_9                         (EXTI_EXTI1|EXTI_RESERVED |              0x09u)
#define EXTI1_LINE_10                        (EXTI_EXTI1|EXTI_RESERVED |              0x0Au)
#define EXTI1_LINE_11                        (EXTI_EXTI1|EXTI_RESERVED |              0x0Bu)
#define EXTI1_LINE_12                        (EXTI_EXTI1|EXTI_RESERVED |              0x0Cu)
#define EXTI1_LINE_13                        (EXTI_EXTI1|EXTI_RESERVED |              0x0Du)
#define EXTI1_LINE_14                        (EXTI_EXTI1|EXTI_RESERVED |              0x0Eu)
#define EXTI1_LINE_15                        (EXTI_EXTI1|EXTI_RESERVED |              0x0Fu)
#endif  /* !defined (STM32MP2XX_ASSY3_1_0 ) */
#define EXTI1_LINE_16                        (EXTI_EXTI1|EXTI_CONFIG   |              0x10u)
#define EXTI1_LINE_17                        (EXTI_EXTI1|EXTI_CONFIG   |              0x11u)
#if defined(STM32MP21xxxx)
#define EXTI1_LINE_18                        (EXTI_EXTI1|EXTI_DIRECT   |              0x12u)
#else
#define EXTI1_LINE_18                        (EXTI_EXTI1|EXTI_CONFIG   |              0x12u)
#endif
#if ! defined (STM32MP2XX_ASSY3_1_0 )
#define EXTI1_LINE_19                        (EXTI_EXTI1|EXTI_DIRECT   |              0x13u)
#else   /* !defined (STM32MP2XX_ASSY3_1_0 ) */
#define EXTI1_LINE_19                        (EXTI_EXTI1|EXTI_CONFIG   |              0x13u)
#endif  /* !defined (STM32MP2XX_ASSY3_1_0 ) */
#define EXTI1_LINE_20                        (EXTI_EXTI1|EXTI_RESERVED |              0x14u)
#define EXTI1_LINE_21                        (EXTI_EXTI1|EXTI_DIRECT   |              0x15u)
#define EXTI1_LINE_22                        (EXTI_EXTI1|EXTI_DIRECT   |              0x16u)
#define EXTI1_LINE_23                        (EXTI_EXTI1|EXTI_DIRECT   |              0x17u)
#if defined(STM32MP21xxxx)
#define EXTI1_LINE_24                        (EXTI_EXTI1|EXTI_RESERVED |              0x18u)
#define EXTI1_LINE_25                        (EXTI_EXTI1|EXTI_RESERVED |              0x19u)
#else
#define EXTI1_LINE_24                        (EXTI_EXTI1|EXTI_DIRECT   |              0x18u)
#define EXTI1_LINE_25                        (EXTI_EXTI1|EXTI_DIRECT   |              0x19u)
#endif
#define EXTI1_LINE_26                        (EXTI_EXTI1|EXTI_DIRECT   |              0x1Au)
#define EXTI1_LINE_27                        (EXTI_EXTI1|EXTI_DIRECT   |              0x1Bu)
#define EXTI1_LINE_28                        (EXTI_EXTI1|EXTI_DIRECT   |              0x1Cu)
#define EXTI1_LINE_29                        (EXTI_EXTI1|EXTI_DIRECT   |              0x1Du)
#define EXTI1_LINE_30                        (EXTI_EXTI1|EXTI_DIRECT   |              0x1Eu)
#define EXTI1_LINE_31                        (EXTI_EXTI1|EXTI_DIRECT   |              0x1Fu)
#define EXTI1_LINE_32                        (EXTI_EXTI1|EXTI_DIRECT   |              0x20u)
#if defined(STM32MP21xxxx)
#define EXTI1_LINE_33                        (EXTI_EXTI1|EXTI_RESERVED |              0x21u)
#define EXTI1_LINE_34                        (EXTI_EXTI1|EXTI_RESERVED |              0x22u)
#else
#define EXTI1_LINE_33                        (EXTI_EXTI1|EXTI_DIRECT   |              0x21u)
#define EXTI1_LINE_34                        (EXTI_EXTI1|EXTI_DIRECT   |              0x22u)
#endif
#define EXTI1_LINE_35                        (EXTI_EXTI1|EXTI_RESERVED |              0x23u)
#define EXTI1_LINE_36                        (EXTI_EXTI1|EXTI_DIRECT   |              0x24u)
#define EXTI1_LINE_37                        (EXTI_EXTI1|EXTI_DIRECT   |              0x25u)
#define EXTI1_LINE_38                        (EXTI_EXTI1|EXTI_DIRECT   |              0x26u)
#define EXTI1_LINE_39                        (EXTI_EXTI1|EXTI_DIRECT   |              0x27u)
#define EXTI1_LINE_40                        (EXTI_EXTI1|EXTI_DIRECT   |              0x28u)
#define EXTI1_LINE_41                        (EXTI_EXTI1|EXTI_DIRECT   |              0x29u)
#if defined(STM32MP21xxxx)
#define EXTI1_LINE_42                        (EXTI_EXTI1|EXTI_RESERVED |              0x2Au)
#else
#define EXTI1_LINE_42                        (EXTI_EXTI1|EXTI_DIRECT   |              0x2Au)
#endif
#define EXTI1_LINE_43                        (EXTI_EXTI1|EXTI_CONFIG   |              0x2Bu)
#define EXTI1_LINE_44                        (EXTI_EXTI1|EXTI_CONFIG   |              0x2Cu)
#if defined(STM32MP21xxxx)
#define EXTI1_LINE_45                        (EXTI_EXTI1|EXTI_RESERVED |              0x2Du)
#else
#define EXTI1_LINE_45                        (EXTI_EXTI1|EXTI_CONFIG   |              0x2Du)
#endif
#if ! defined (STM32MP2XX_ASSY3_1_0 )
#if defined(STM32MP21xxxx)
#define EXTI1_LINE_46                        (EXTI_EXTI1|EXTI_RESERVED |              0x2Eu)
#else
#define EXTI1_LINE_46                        (EXTI_EXTI1|EXTI_DIRECT   |              0x2Eu)
#endif
#else   /* !defined (STM32MP2XX_ASSY3_1_0 ) */
#define EXTI1_LINE_46                        (EXTI_EXTI1|EXTI_CONFIG   |              0x2Eu)
#endif  /* !defined (STM32MP2XX_ASSY3_1_0 ) */
#define EXTI1_LINE_47                        (EXTI_EXTI1|EXTI_DIRECT   |              0x2Fu)
#define EXTI1_LINE_48                        (EXTI_EXTI1|EXTI_DIRECT   |              0x30u)
#if defined(STM32MP21xxxx)
#define EXTI1_LINE_49                        (EXTI_EXTI1|EXTI_RESERVED |              0x31u)
#define EXTI1_LINE_50                        (EXTI_EXTI1|EXTI_RESERVED |              0x32u)
#else
#define EXTI1_LINE_49                        (EXTI_EXTI1|EXTI_DIRECT   |              0x31u)
#define EXTI1_LINE_50                        (EXTI_EXTI1|EXTI_DIRECT   |              0x32u)
#endif
#define EXTI1_LINE_51                        (EXTI_EXTI1|EXTI_RESERVED |              0x33u)
#define EXTI1_LINE_52                        (EXTI_EXTI1|EXTI_DIRECT   |              0x34u)
#define EXTI1_LINE_53                        (EXTI_EXTI1|EXTI_DIRECT   |              0x35u)
#define EXTI1_LINE_54                        (EXTI_EXTI1|EXTI_DIRECT   |              0x36u)
#define EXTI1_LINE_55                        (EXTI_EXTI1|EXTI_DIRECT   |              0x37u)
#define EXTI1_LINE_56                        (EXTI_EXTI1|EXTI_DIRECT   |              0x38u)
#define EXTI1_LINE_57                        (EXTI_EXTI1|EXTI_DIRECT   |              0x39u)
#define EXTI1_LINE_58                        (EXTI_EXTI1|EXTI_RESERVED |              0x3Au)
#if defined (CORE_CM33)
#define EXTI1_LINE_59                        (EXTI_EXTI1|EXTI_RESERVED |              0x3Bu)
#define EXTI1_LINE_60                        (EXTI_EXTI1|EXTI_DIRECT   |              0x3Cu)
#define EXTI1_LINE_61                        (EXTI_EXTI1|EXTI_RESERVED |              0x3Du)
#define EXTI1_LINE_62                        (EXTI_EXTI1|EXTI_DIRECT   |              0x3Eu)
#else   /* CORE_CM33 */
#define EXTI1_LINE_59                        (EXTI_EXTI1|EXTI_DIRECT   |              0x3Bu)
#define EXTI1_LINE_60                        (EXTI_EXTI1|EXTI_RESERVED |              0x3Cu)
#define EXTI1_LINE_61                        (EXTI_EXTI1|EXTI_DIRECT   |              0x3Du)
#define EXTI1_LINE_62                        (EXTI_EXTI1|EXTI_RESERVED |              0x3Eu)
#endif  /* CORE_CM33 */
#define EXTI1_LINE_63                        (EXTI_EXTI1|EXTI_RESERVED |              0x3Fu)
#if defined (CORE_CA35)
#define EXTI1_LINE_64                        (EXTI_EXTI1|EXTI_CONFIG   |              0x40u)
#else   /* CORE_CA35 */
#define EXTI1_LINE_64                        (EXTI_EXTI1|EXTI_RESERVED |              0x40u)
#endif  /* CORE_CA35 */
#if defined (CORE_CM33)
#define EXTI1_LINE_65                        (EXTI_EXTI1|EXTI_CONFIG   | EXTI_EVENT | 0x41u)
#else   /* CORE_CM33 */
#define EXTI1_LINE_65                        (EXTI_EXTI1|EXTI_RESERVED |              0x41u)
#endif  /* CORE_CM33 */
#define EXTI1_LINE_66                        (EXTI_EXTI1|EXTI_RESERVED |              0x42u)
#if defined (CORE_CA35)
#define EXTI1_LINE_67                        (EXTI_EXTI1|EXTI_CONFIG   |              0x43u)
#else   /* CORE_CA35 */
#define EXTI1_LINE_67                        (EXTI_EXTI1|EXTI_RESERVED |              0x43u)
#endif  /* CORE_CA35 */
#define EXTI1_LINE_68                        (EXTI_EXTI1|EXTI_DIRECT   |              0x44u)
#if ! defined (STM32MP2XX_ASSY3_1_0 )
#define EXTI1_LINE_69                        (EXTI_EXTI1|EXTI_RESERVED |              0x45u)
#else   /* !defined (STM32MP2XX_ASSY3_1_0 ) */
#define EXTI1_LINE_69                        (EXTI_EXTI1|EXTI_DIRECT   |              0x45u)
#endif  /* !defined (STM32MP2XX_ASSY3_1_0 ) */
#define EXTI1_LINE_70                        (EXTI_EXTI1|EXTI_DIRECT   |              0x46u)
#if ! defined (STM32MP2XX_ASSY3_1_0 )
#define EXTI1_LINE_71                        (EXTI_EXTI1|EXTI_RESERVED |              0x47u)
#else   /* !defined (STM32MP2XX_ASSY3_1_0 ) */
#define EXTI1_LINE_71                        (EXTI_EXTI1|EXTI_DIRECT   |              0x47u)
#endif  /* !defined (STM32MP2XX_ASSY3_1_0 ) */
#define EXTI1_LINE_72                        (EXTI_EXTI1|EXTI_DIRECT   |              0x48u)
#if defined (CORE_CA35)
#define EXTI1_LINE_73                        (EXTI_EXTI1|EXTI_CONFIG   |              0x49u)
#else   /* CORE_CA35 */
#define EXTI1_LINE_73                        (EXTI_EXTI1|EXTI_RESERVED |              0x49u)
#endif  /* CORE_CA35 */
#define EXTI1_LINE_74                        (EXTI_EXTI1|EXTI_DIRECT   |              0x4Au)
#define EXTI1_LINE_75                        (EXTI_EXTI1|EXTI_DIRECT   |              0x4Bu)
#define EXTI1_LINE_76                        (EXTI_EXTI1|EXTI_DIRECT   |              0x4Cu)
#if defined (CORE_CA35)
#define EXTI1_LINE_77                        (EXTI_EXTI1|EXTI_DIRECT   |              0x4Du)
#define EXTI1_LINE_78                        (EXTI_EXTI1|EXTI_DIRECT   |              0x4Eu)
#define EXTI1_LINE_79                        (EXTI_EXTI1|EXTI_DIRECT   |              0x4Fu)
#else   /* CORE_CA35 */
#define EXTI1_LINE_77                        (EXTI_EXTI1|EXTI_RESERVED |              0x4Du)
#define EXTI1_LINE_78                        (EXTI_EXTI1|EXTI_RESERVED |              0x4Eu)
#define EXTI1_LINE_79                        (EXTI_EXTI1|EXTI_RESERVED |              0x4Fu)
#endif  /* CORE_CA35 */
#if defined (CORE_CM33)
#define EXTI1_LINE_80                        (EXTI_EXTI1|EXTI_DIRECT   |              0x50u)
#define EXTI1_LINE_81                        (EXTI_EXTI1|EXTI_DIRECT   |              0x51u)
#define EXTI1_LINE_82                        (EXTI_EXTI1|EXTI_DIRECT   |              0x52u)
#else   /* CORE_CM33 */
#define EXTI1_LINE_80                        (EXTI_EXTI1|EXTI_RESERVED |              0x50u)
#define EXTI1_LINE_81                        (EXTI_EXTI1|EXTI_RESERVED |              0x51u)
#define EXTI1_LINE_82                        (EXTI_EXTI1|EXTI_RESERVED |              0x52u)
#endif  /* CORE_CM33 */
#if defined(STM32MP21xxxx)
#define EXTI1_LINE_83                        (EXTI_EXTI1|EXTI_RESERVED |              0x53u)
#define EXTI1_LINE_84                        (EXTI_EXTI1|EXTI_RESERVED |              0x54u)
#else
#define EXTI1_LINE_83                        (EXTI_EXTI1|EXTI_CONFIG   |              0x53u)
#define EXTI1_LINE_84                        (EXTI_EXTI1|EXTI_CONFIG   |              0x54u)
#endif
/**
  * @brief  EXTI1 Line number
  */
#define EXTI1_LINE_NB                        85U

/**
  * @brief  EXTI1 GPIO Pin Max  (GPIO not available on EXTI1)
  */

#if ! defined (STM32MP2XX_ASSY3_1_0 )
#define EXTI1_GPIO_PIN_MAX                    16u
#else   /* !defined (STM32MP2XX_ASSY3_1_0 ) */
#define EXTI1_GPIO_PIN_MAX                    0u
#endif  /* !defined (STM32MP2XX_ASSY3_1_0 ) */

/**
  * @}
  */

