zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_exti.h
/** @defgroup EXTI2_Line  EXTI2 Line
  * @{
  */
#define EXTI2_LINE_0                         (EXTI_EXTI2|EXTI_GPIO     | EXTI_EVENT | 0x00u)
#define EXTI2_LINE_1                         (EXTI_EXTI2|EXTI_GPIO     | EXTI_EVENT | 0x01u)
#define EXTI2_LINE_2                         (EXTI_EXTI2|EXTI_GPIO     | EXTI_EVENT | 0x02u)
#define EXTI2_LINE_3                         (EXTI_EXTI2|EXTI_GPIO     | EXTI_EVENT | 0x03u)
#define EXTI2_LINE_4                         (EXTI_EXTI2|EXTI_GPIO     | EXTI_EVENT | 0x04u)
#define EXTI2_LINE_5                         (EXTI_EXTI2|EXTI_GPIO     | EXTI_EVENT | 0x05u)
#define EXTI2_LINE_6                         (EXTI_EXTI2|EXTI_GPIO     | EXTI_EVENT | 0x06u)
#define EXTI2_LINE_7                         (EXTI_EXTI2|EXTI_GPIO     | EXTI_EVENT | 0x07u)
#define EXTI2_LINE_8                         (EXTI_EXTI2|EXTI_GPIO     | EXTI_EVENT | 0x08u)
#define EXTI2_LINE_9                         (EXTI_EXTI2|EXTI_GPIO     | EXTI_EVENT | 0x09u)
#define EXTI2_LINE_10                        (EXTI_EXTI2|EXTI_GPIO     | EXTI_EVENT | 0x0Au)
#define EXTI2_LINE_11                        (EXTI_EXTI2|EXTI_GPIO     | EXTI_EVENT | 0x0Bu)
#define EXTI2_LINE_12                        (EXTI_EXTI2|EXTI_GPIO     | EXTI_EVENT | 0x0Cu)
#define EXTI2_LINE_13                        (EXTI_EXTI2|EXTI_GPIO     | EXTI_EVENT | 0x0Du)
#define EXTI2_LINE_14                        (EXTI_EXTI2|EXTI_GPIO     | EXTI_EVENT | 0x0Eu)
#define EXTI2_LINE_15                        (EXTI_EXTI2|EXTI_GPIO     | EXTI_EVENT | 0x0Fu)

#if ! defined (STM32MP2XX_ASSY3_1_0 )
/* no more events */
#if defined (CORE_CA35)
#define EXTI2_LINE_16                        (EXTI_EXTI2|EXTI_DIRECT   |              0x10u)
#define EXTI2_LINE_17                        (EXTI_EXTI2|EXTI_DIRECT   |              0x11u)
#else   /* CORE_CA35 */
#define EXTI2_LINE_16                        (EXTI_EXTI2|EXTI_RESERVED |              0x10u)
#define EXTI2_LINE_17                        (EXTI_EXTI2|EXTI_RESERVED |              0x11u)
#endif  /* CORE_CA35 */
#if defined (CORE_CM33)
#define EXTI2_LINE_18                        (EXTI_EXTI2|EXTI_DIRECT   |              0x12u)
#define EXTI2_LINE_19                        (EXTI_EXTI2|EXTI_DIRECT   |              0x13u)
#else   /* CORE_CM33 */
#define EXTI2_LINE_18                        (EXTI_EXTI2|EXTI_RESERVED |              0x12u)
#define EXTI2_LINE_19                        (EXTI_EXTI2|EXTI_RESERVED |              0x13u)
#endif  /* CORE_CM33 */
#if defined (CORE_CM0PLUS)
#define EXTI2_LINE_20                        (EXTI_EXTI2|EXTI_DIRECT   |              0x14u)
#else   /* CORE_CM0PLUS */
#define EXTI2_LINE_20                        (EXTI_EXTI2|EXTI_RESERVED |              0x14u)
#endif  /* CORE_CM0PLUS */
#if defined (CORE_CA35)
#define EXTI2_LINE_21                        (EXTI_EXTI2|EXTI_DIRECT   |              0x15u)
#define EXTI2_LINE_22                        (EXTI_EXTI2|EXTI_DIRECT   |              0x16u)
#else   /* CORE_CA35 */
#define EXTI2_LINE_21                        (EXTI_EXTI2|EXTI_RESERVED |              0x15u)
#define EXTI2_LINE_22                        (EXTI_EXTI2|EXTI_RESERVED |              0x16u)
#endif  /* CORE_CA35 */
#if defined (CORE_CM33)
#define EXTI2_LINE_23                        (EXTI_EXTI2|EXTI_DIRECT   |              0x17u)
#define EXTI2_LINE_24                        (EXTI_EXTI2|EXTI_DIRECT   |              0x18u)
#else   /* CORE_CM33 */
#define EXTI2_LINE_23                        (EXTI_EXTI2|EXTI_RESERVED |              0x17u)
#define EXTI2_LINE_24                        (EXTI_EXTI2|EXTI_RESERVED |              0x18u)
#endif  /* CORE_CM33 */
#else   /* !defined (STM32MP2XX_ASSY3_1_0 ) */
#if defined (CORE_CA35)
#define EXTI2_LINE_16                        (EXTI_EXTI2|EXTI_DIRECT   | EXTI_EVENT | 0x10u)
#define EXTI2_LINE_17                        (EXTI_EXTI2|EXTI_DIRECT   | EXTI_EVENT | 0x11u)
#else   /* CORE_CA35 */
#define EXTI2_LINE_16                        (EXTI_EXTI2|EXTI_RESERVED |              0x10u)
#define EXTI2_LINE_17                        (EXTI_EXTI2|EXTI_RESERVED |              0x11u)
#endif  /* CORE_CA35 */
#if defined (CORE_CM33)
#define EXTI2_LINE_18                        (EXTI_EXTI2|EXTI_DIRECT   | EXTI_EVENT | 0x12u)
#define EXTI2_LINE_19                        (EXTI_EXTI2|EXTI_DIRECT   | EXTI_EVENT | 0x13u)
#else   /* CORE_CM33 */
#define EXTI2_LINE_18                        (EXTI_EXTI2|EXTI_RESERVED |              0x12u)
#define EXTI2_LINE_19                        (EXTI_EXTI2|EXTI_RESERVED |              0x13u)
#endif  /* CORE_CM33 */
#if defined (CORE_CM0PLUS)
#define EXTI2_LINE_20                        (EXTI_EXTI2|EXTI_DIRECT   | EXTI_EVENT | 0x14u)
#else   /* CORE_CM0PLUS */
#define EXTI2_LINE_20                        (EXTI_EXTI2|EXTI_RESERVED |              0x14u)
#endif  /* CORE_CM0PLUS */
#if defined (CORE_CA35)
#define EXTI2_LINE_21                        (EXTI_EXTI2|EXTI_DIRECT   | EXTI_EVENT | 0x15u)
#define EXTI2_LINE_22                        (EXTI_EXTI2|EXTI_DIRECT   | EXTI_EVENT | 0x16u)
#else   /* CORE_CA35 */
#define EXTI2_LINE_21                        (EXTI_EXTI2|EXTI_RESERVED |              0x15u)
#define EXTI2_LINE_22                        (EXTI_EXTI2|EXTI_RESERVED |              0x16u)
#endif  /* CORE_CA35 */
#if defined (CORE_CM33)
#define EXTI2_LINE_23                        (EXTI_EXTI2|EXTI_DIRECT   | EXTI_EVENT | 0x17u)
#define EXTI2_LINE_24                        (EXTI_EXTI2|EXTI_DIRECT   | EXTI_EVENT | 0x18u)
#else   /* CORE_CM33 */
#define EXTI2_LINE_23                        (EXTI_EXTI2|EXTI_RESERVED |              0x17u)
#define EXTI2_LINE_24                        (EXTI_EXTI2|EXTI_RESERVED |              0x18u)
#endif  /* CORE_CM33 */
#endif  /* !defined (STM32MP2XX_ASSY3_1_0 ) */


#if defined(STM32MP21xxxx)
#define EXTI2_LINE_25                        (EXTI_EXTI2|EXTI_RESERVED |              0x19u)
#else
#define EXTI2_LINE_25                        (EXTI_EXTI2|EXTI_DIRECT   |              0x19u)
#endif
#define EXTI2_LINE_26                        (EXTI_EXTI2|EXTI_DIRECT   |              0x1Au)
#if defined(STM32MP21xxxx)
#define EXTI2_LINE_27                        (EXTI_EXTI2|EXTI_RESERVED |              0x1Bu)
#else
#define EXTI2_LINE_27                        (EXTI_EXTI2|EXTI_DIRECT   |              0x1Bu)
#endif
#define EXTI2_LINE_28                        (EXTI_EXTI2|EXTI_RESERVED |              0x1Cu)
#define EXTI2_LINE_29                        (EXTI_EXTI2|EXTI_DIRECT   |              0x1Du)
#define EXTI2_LINE_30                        (EXTI_EXTI2|EXTI_DIRECT   |              0x1Eu)
#define EXTI2_LINE_31                        (EXTI_EXTI2|EXTI_DIRECT   |              0x1Fu)
#define EXTI2_LINE_32                        (EXTI_EXTI2|EXTI_RESERVED |              0x20u)
#if defined(STM32MP21xxxx)
#define EXTI2_LINE_33                        (EXTI_EXTI2|EXTI_RESERVED |              0x21u)
#else
#define EXTI2_LINE_33                        (EXTI_EXTI2|EXTI_DIRECT   |              0x21u)
#endif
#if defined (CORE_CA35)
#define EXTI2_LINE_34                        (EXTI_EXTI2|EXTI_RESERVED |              0x22u)
#else   /* CORE_CA35 */
#if defined(STM32MP21xxxx)
#define EXTI2_LINE_34                        (EXTI_EXTI2|EXTI_CONFIG   |              0x22u)
#else
#define EXTI2_LINE_34                        (EXTI_EXTI2|EXTI_RESERVED |              0x22u)
#endif
#endif  /* CORE_CA35 */
#if defined (CORE_CM33)
#if defined(STM32MP21xxxx)
#define EXTI2_LINE_35                        (EXTI_EXTI2|EXTI_CONFIG |              0x23u)
#else
#define EXTI2_LINE_35                        (EXTI_EXTI2|EXTI_DIRECT   |              0x23u)
#endif
#else   /* CORE_CM33 */
#define EXTI2_LINE_35                        (EXTI_EXTI2|EXTI_CONFIG   |              0x23u)
#endif  /* CORE_CM33 */
#if defined (CORE_CM0PLUS)
#define EXTI2_LINE_36                        (EXTI_EXTI2|EXTI_DIRECT   |              0x24u)
#else   /* CORE_CM0PLUS */
#define EXTI2_LINE_36                        (EXTI_EXTI2|EXTI_CONFIG   |              0x24u)
#endif  /* CORE_CM0PLUS */
#if defined (CORE_CA35)
#define EXTI2_LINE_37                        (EXTI_EXTI2|EXTI_CONFIG   |              0x25u)
#else   /* CORE_CA35 */
#if defined(STM32MP21xxxx)
#define EXTI2_LINE_37                        (EXTI_EXTI2|EXTI_CONFIG   |              0x25u)
#else
#define EXTI2_LINE_37                        (EXTI_EXTI2|EXTI_RESERVED |              0x25u)
#endif
#endif  /* CORE_CA35 */
#if defined (CORE_CM33)
#if defined(STM32MP21xxxx)
#define EXTI2_LINE_38                        (EXTI_EXTI2|EXTI_RESERVED |              0x26u)
#else
#define EXTI2_LINE_38                        (EXTI_EXTI2|EXTI_DIRECT   |              0x26u)
#endif
#else   /* CORE_CM33 */
#define EXTI2_LINE_38                        (EXTI_EXTI2|EXTI_RESERVED |              0x26u)
#endif  /* CORE_CM33 */
#define EXTI2_LINE_39                        (EXTI_EXTI2|EXTI_DIRECT   |              0x27u)
#if defined (CORE_CA35)
#define EXTI2_LINE_40                        (EXTI_EXTI2|EXTI_DIRECT   |              0x28u)
#else   /* CORE_CA35 */
#define EXTI2_LINE_40                        (EXTI_EXTI2|EXTI_RESERVED |              0x28u)
#endif  /* CORE_CA35 */
#if defined (CORE_CM33)
#define EXTI2_LINE_41                        (EXTI_EXTI2|EXTI_DIRECT   |              0x29u)
#else   /* CORE_CM33 */
#define EXTI2_LINE_41                        (EXTI_EXTI2|EXTI_RESERVED |              0x29u)
#endif  /* CORE_CM33 */
#if defined (CORE_CM0PLUS)
#define EXTI2_LINE_42                        (EXTI_EXTI2|EXTI_DIRECT   |              0x2Au)
#else   /* CORE_CM0PLUS */
#if defined(STM32MP21xxxx)
#define EXTI2_LINE_42                        (EXTI_EXTI2|EXTI_RESERVED |              0x2Au)
#else
#define EXTI2_LINE_42                        (EXTI_EXTI2|EXTI_RESERVED |              0x2Au)
#endif
#endif  /* CORE_CM0PLUS */
#if defined (CORE_CA35)
#define EXTI2_LINE_43                        (EXTI_EXTI2|EXTI_RESERVED   |              0x2Bu)
#else   /* CORE_CA35 */
#define EXTI2_LINE_43                        (EXTI_EXTI2|EXTI_RESERVED |              0x2Bu)
#endif  /* CORE_CA35 */
#if defined (CORE_CM33)
#if defined(STM32MP21xxxx)
#define EXTI2_LINE_44                        (EXTI_EXTI2|EXTI_RESERVED |              0x2Cu)
#else
#define EXTI2_LINE_44                        (EXTI_EXTI2|EXTI_DIRECT   |              0x2Cu)
#endif
#else   /* CORE_CM33 */
#define EXTI2_LINE_44                        (EXTI_EXTI2|EXTI_RESERVED |              0x2Cu)
#endif  /* CORE_CM33 */
#define EXTI2_LINE_45                        (EXTI_EXTI2|EXTI_RESERVED |              0x2Du)
#if defined (CORE_CA35) || defined (CORE_CM33)
#if defined(STM32MP21xxxx)
#define EXTI2_LINE_46                        (EXTI_EXTI2|EXTI_RESERVED |              0x2Eu)
#else
#define EXTI2_LINE_46                        (EXTI_EXTI2|EXTI_CONFIG   |              0x2Eu)
#endif
#else   /* CORE_CA35 || CORE_CM33 */
#define EXTI2_LINE_46                        (EXTI_EXTI2|EXTI_RESERVED |              0x2Eu)
#endif  /* CORE_CA35 || CORE_CM33 */
#if defined (CORE_CM33)
#if defined(STM32MP21xxxx)
#define EXTI2_LINE_47                        (EXTI_EXTI2|EXTI_RESERVED |              0x2Fu)
#else
#define EXTI2_LINE_47                        (EXTI_EXTI2|EXTI_CONFIG   |              0x2Fu)
#endif
#else   /* CORE_CM33 */
#define EXTI2_LINE_47                        (EXTI_EXTI2|EXTI_RESERVED |              0x2Fu)
#endif  /* CORE_CM33 */
#if defined (CORE_CA35) || defined (CORE_CM33)
#if defined(STM32MP21xxxx)
#define EXTI2_LINE_48                        (EXTI_EXTI2|EXTI_RESERVED |              0x30u)
#else
#define EXTI2_LINE_48                        (EXTI_EXTI2|EXTI_CONFIG   |              0x30u)
#endif
#else   /* CORE_CA35 || CORE_CM33 */
#define EXTI2_LINE_48                        (EXTI_EXTI2|EXTI_RESERVED |              0x30u)
#endif  /* CORE_CA35 || CORE_CM33 */
#if defined (CORE_CA35)
#define EXTI2_LINE_49                        (EXTI_EXTI2|EXTI_DIRECT   |              0x31u)
#else   /* CORE_CA35 */
#define EXTI2_LINE_49                        (EXTI_EXTI2|EXTI_RESERVED |              0x31u)
#endif  /* CORE_CA35 */
#if defined (CORE_CA35) || defined (CORE_CM33)
#if defined(STM32MP21xxxx)
#define EXTI2_LINE_50                        (EXTI_EXTI2|EXTI_RESERVED |              0x32u)
#else
#define EXTI2_LINE_50                        (EXTI_EXTI2|EXTI_CONFIG   |              0x32u)
#endif
#define EXTI2_LINE_51                        (EXTI_EXTI2|EXTI_CONFIG   |              0x33u)
#else   /* CORE_CA35 || CORE_CM33 */
#define EXTI2_LINE_50                        (EXTI_EXTI2|EXTI_RESERVED |              0x32u)
#define EXTI2_LINE_51                        (EXTI_EXTI2|EXTI_RESERVED |              0x33u)
#endif  /* CORE_CA35 || CORE_CM33 */
#if defined (CORE_CA35)
#define EXTI2_LINE_52                        (EXTI_EXTI2|EXTI_CONFIG   |              0x34u)
#define EXTI2_LINE_53                        (EXTI_EXTI2|EXTI_CONFIG   |              0x35u)
#else   /* CORE_CA35 */
#if defined(STM32MP21xxxx)
#define EXTI2_LINE_52                        (EXTI_EXTI2|EXTI_CONFIG   |              0x34u)
#else
#define EXTI2_LINE_52                        (EXTI_EXTI2|EXTI_RESERVED |              0x34u)
#endif
#define EXTI2_LINE_53                        (EXTI_EXTI2|EXTI_RESERVED |              0x35u)
#endif  /* CORE_CA35 */
#if defined (CORE_CM33)
#if defined(STM32MP21xxxx)
#define EXTI2_LINE_54                        (EXTI_EXTI2|EXTI_RESERVED |              0x36u)
#define EXTI2_LINE_55                        (EXTI_EXTI2|EXTI_RESERVED |              0x37u)
#else
#define EXTI2_LINE_54                        (EXTI_EXTI2|EXTI_DIRECT   |              0x36u)
#define EXTI2_LINE_55                        (EXTI_EXTI2|EXTI_DIRECT   |              0x37u)
#endif
#else   /* CORE_CM33 */
#define EXTI2_LINE_54                        (EXTI_EXTI2|EXTI_RESERVED |              0x36u)
#define EXTI2_LINE_55                        (EXTI_EXTI2|EXTI_RESERVED |              0x37u)
#endif  /* CORE_CM33 */
#if defined (CORE_CM0PLUS)
#define EXTI2_LINE_56                        (EXTI_EXTI2|EXTI_DIRECT   |              0x38u)
#else   /* CORE_CM0PLUS */
#define EXTI2_LINE_56                        (EXTI_EXTI2|EXTI_RESERVED |              0x38u)
#endif  /* CORE_CM0PLUS */
#define EXTI2_LINE_57                        (EXTI_EXTI2|EXTI_RESERVED |              0x39u)
#define EXTI2_LINE_58                        (EXTI_EXTI2|EXTI_RESERVED |              0x3Au)
#if defined (CORE_CM0PLUS)
#define EXTI2_LINE_59                        (EXTI_EXTI2|EXTI_CONFIG   | EXTI_EVENT | 0x3Bu)
#define EXTI2_LINE_60                        (EXTI_EXTI2|EXTI_CONFIG   | EXTI_EVENT | 0x3Cu)
#else   /* CORE_CM0PLUS */
#define EXTI2_LINE_59                        (EXTI_EXTI2|EXTI_RESERVED |              0x3Bu)
#define EXTI2_LINE_60                        (EXTI_EXTI2|EXTI_RESERVED |              0x3Cu)
#endif  /* CORE_CM0PLUS */
#if defined (CORE_CA35) || defined (CORE_CM33)
#if defined(STM32MP21xxxx)
#define EXTI2_LINE_61                        (EXTI_EXTI2|EXTI_RESERVED |              0x3Du)
#else
#define EXTI2_LINE_61                        (EXTI_EXTI2|EXTI_CONFIG   |              0x3Du)
#endif
#else   /* CORE_CA35 || CORE_CM33 */
#define EXTI2_LINE_61                        (EXTI_EXTI2|EXTI_RESERVED |              0x3Du)
#endif  /* CORE_CA35 || CORE_CM33 */
#if defined (CORE_CA35)
#define EXTI2_LINE_62                        (EXTI_EXTI2|EXTI_DIRECT   |              0x3Eu)
#else   /* CORE_CA35 */
#define EXTI2_LINE_62                        (EXTI_EXTI2|EXTI_RESERVED |              0x3Eu)
#endif  /* CORE_CA35 */
#if defined (CORE_CM33)
#if defined(STM32MP21xxxx)
#define EXTI2_LINE_63                        (EXTI_EXTI2|EXTI_RESERVED |              0x3Fu)
#else
#define EXTI2_LINE_63                        (EXTI_EXTI2|EXTI_DIRECT   |              0x3Fu)
#endif
#else   /* CORE_CM33 */
#define EXTI2_LINE_63                        (EXTI_EXTI2|EXTI_RESERVED |              0x3Fu)
#endif  /* CORE_CM33 */
#define EXTI2_LINE_64                        (EXTI_EXTI2|EXTI_CONFIG   |              0x40u)
#define EXTI2_LINE_65                        (EXTI_EXTI2|EXTI_CONFIG   |              0x41u)
#if defined (CORE_CA35)
#define EXTI2_LINE_66                        (EXTI_EXTI2|EXTI_CONFIG   |              0x42u)
#else   /* CORE_CA35 */
#define EXTI2_LINE_66                        (EXTI_EXTI2|EXTI_RESERVED |              0x42u)
#endif  /* CORE_CA35 */
#if defined (CORE_CA35)
#define EXTI2_LINE_67                        (EXTI_EXTI2|EXTI_DIRECT   |              0x43u)
#else   /* CORE_CA35 */
#define EXTI2_LINE_67                        (EXTI_EXTI2|EXTI_RESERVED |              0x43u)
#endif  /* CORE_CA35 */
#if defined (CORE_CM33)
#define EXTI2_LINE_68                        (EXTI_EXTI2|EXTI_DIRECT   |              0x44u)
#else   /* CORE_CM33 */
#define EXTI2_LINE_68                        (EXTI_EXTI2|EXTI_RESERVED |              0x44u)
#endif  /* CORE_CM33 */
#if defined (CORE_CM0PLUS)
#define EXTI2_LINE_69                        (EXTI_EXTI2|EXTI_DIRECT   |              0x45u)
#else   /* CORE_CM0PLUS */
#define EXTI2_LINE_69                        (EXTI_EXTI2|EXTI_RESERVED |              0x45u)
#endif  /* CORE_CM0PLUS */
#define EXTI2_LINE_70                        (EXTI_EXTI2|EXTI_DIRECT   |              0x46u)
#define EXTI2_LINE_71                        (EXTI_EXTI2|EXTI_RESERVED |              0x47u)
#define EXTI2_LINE_72                        (EXTI_EXTI2|EXTI_RESERVED |              0x48u)
#define EXTI2_LINE_73                        (EXTI_EXTI2|EXTI_RESERVED |              0x49u)
#define EXTI2_LINE_74                        (EXTI_EXTI2|EXTI_RESERVED |              0x4Au)
#define EXTI2_LINE_75                        (EXTI_EXTI2|EXTI_RESERVED |              0x4Bu)
#define EXTI2_LINE_76                        (EXTI_EXTI2|EXTI_DIRECT   |              0x4Cu)

/**
  * @brief  EXTI2 Line number
  */
#if defined(STM32MP21xxxx)
#define EXTI2_LINE_NB                        64U
#else
#define EXTI2_LINE_NB                        77U
#endif /* EXTI LINE 64 */

/**
  * @brief  EXTI2 GPIO Pin Max
  */

#define EXTI2_GPIO_PIN_MAX                    16u

/**
  * @}
  */

