zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_exti.h
/** @defgroup EXTI_Mode  EXTI Mode
  * @{
  */
#define EXTI_MODE_NONE                      0x00000000U
#define EXTI_MODE_INTERRUPT                 0x00000001U
#define EXTI_MODE_EVENT                     0x00000002U
/**
  * @}
  */

/** @defgroup EXTI_Trigger  EXTI Trigger
  * @{
  */
#define EXTI_TRIGGER_NONE                   0x00000000U
#define EXTI_TRIGGER_RISING                 0x00000001U
#define EXTI_TRIGGER_FALLING                0x00000002U
#define EXTI_TRIGGER_RISING_FALLING         (EXTI_TRIGGER_RISING | EXTI_TRIGGER_FALLING)
/**
  * @}
  */

/** @defgroup EXTI_GPIOSel  EXTI GPIOSel
  * @{
  */
#if defined (CORE_CA35) || defined (CORE_CM33)
#define EXTI_GPIOA                          0x00000000U
#define EXTI_GPIOB                          0x00000001U
#define EXTI_GPIOC                          0x00000002U
#define EXTI_GPIOD                          0x00000003U
#define EXTI_GPIOE                          0x00000004U
#define EXTI_GPIOF                          0x00000005U
#define EXTI_GPIOG                          0x00000006U
#define EXTI_GPIOH                          0x00000007U
#define EXTI_GPIOI                          0x00000008U
#if defined(STM32MP21xxxx)
#define EXTI_GPIOZ                          0x00000009U
#else
#define EXTI_GPIOJ                          0x00000009U
#define EXTI_GPIOK                          0x0000000AU
#define EXTI_GPIOZ                          0x0000000BU
#endif
#else   /* CORE_CA35 || CORE_CM33 */
#define EXTI_GPIOZ                          0x0000000Bu
#endif  /* CORE_CA35 || CORE_CM33 */

/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup EXTI_Exported_Macros EXTI Exported Macros
  * @{
  */

/**
  * @}
  */

/* Private constants --------------------------------------------------------*/
/** @defgroup EXTI_Private_Constants EXTI Private Constants
  * @{
  */
/**
  * @brief  EXTI Line property definition
  */
#define EXTI_PROPERTY_SHIFT                  24UL
#define EXTI_DIRECT                         (0x01UL << EXTI_PROPERTY_SHIFT)
#define EXTI_CONFIG                         (0x02UL << EXTI_PROPERTY_SHIFT)
#define EXTI_GPIO                           ((0x04UL << EXTI_PROPERTY_SHIFT) | EXTI_CONFIG)
#define EXTI_RESERVED                       (0x08UL << EXTI_PROPERTY_SHIFT)
#define EXTI_PROPERTY_MASK                  (EXTI_DIRECT | EXTI_CONFIG | EXTI_GPIO)

/**
  * @brief  EXTI Event presence definition
  */
#define EXTI_EVENT_PRESENCE_SHIFT           28UL
#define EXTI_EVENT_PRESENCE_MASK            (0x01UL << EXTI_EVENT_PRESENCE_SHIFT)
#define EXTI_EVENT                          EXTI_EVENT_PRESENCE_MASK

/**
  * @brief  EXTI Index definition
  */
#define EXTI_INDEX_SHIFT                    30UL
#define EXTI_INDEX_MASK                     (0x01UL << EXTI_INDEX_SHIFT)
#define EXTI_EXTI1                          (0x00UL << EXTI_INDEX_SHIFT)
#define EXTI_EXTI2                          (0x01UL << EXTI_INDEX_SHIFT)
#define EXTI_INDEX                          EXTI_INDEX_MASK

/**
  * @brief  EXTI Pin definition
  * max 256 lines per EXTI
  */
#define EXTI_PIN_MASK                       0x000000FFu

/**
  * @brief  EXTI Mask for interrupt & event mode
  */
#define EXTI_MODE_MASK                      (EXTI_MODE_EVENT | EXTI_MODE_INTERRUPT)

/**
  * @brief  EXTI Mask for trigger possibilities
  */
#define EXTI_TRIGGER_MASK                   (EXTI_TRIGGER_RISING | EXTI_TRIGGER_FALLING)

/**
  * @}
  */

/** @defgroup EXTI_Access_filtering EXTI Access filtering (Global lock and EVENT line)
  * @{
  */

#define EXTI_LINE_ATTR_PRIV_SELECT         0x01000000U
#define EXTI_LINE_ATTR_SEC_SELECT          0x02000000U
#define EXTI_LINE_ATTR_CID_STATIC_SELECT   0x20000000U
#define EXTI_LINE_CID_DISABLE              0x80000000U

#define EXTI_LINE_PRIV_VAL_Pos             0
#define EXTI_LINE_PRIV                     (EXTI_LINE_ATTR_PRIV_SELECT | (1UL << EXTI_LINE_PRIV_VAL_Pos)) /*!< Resource is privileged   */
#define EXTI_LINE_NPRIV                    (EXTI_LINE_ATTR_PRIV_SELECT)                            /*!< Resource is unprivileged */

#if defined (CORTEX_IN_SECURE_STATE)
#define EXTI_LINE_SEC_VAL_Pos              1
#define EXTI_LINE_SEC                      (EXTI_LINE_ATTR_SEC_SELECT | (1UL << EXTI_LINE_SEC_VAL_Pos))  /*!< Resource is secure       */
#define EXTI_LINE_NSEC                     (EXTI_LINE_ATTR_SEC_SELECT)                            /*!< Resource is non-secure   */
#endif /* __ARM_SECURE_STATE */

#define EXTI_LINE_CID_STATIC_0             (EXTI_LINE_ATTR_CID_STATIC_SELECT|(0UL << EXTI_E0CIDCFGR_SCID_Pos))   /*!< Enable CID filtering (static mode) and give pin control  to CID0 */
#define EXTI_LINE_CID_STATIC_1             (EXTI_LINE_ATTR_CID_STATIC_SELECT|(1UL << EXTI_E0CIDCFGR_SCID_Pos))   /*!< Enable CID filtering (static mode) and give pin control  to CID1 */
#define EXTI_LINE_CID_STATIC_2             (EXTI_LINE_ATTR_CID_STATIC_SELECT|(2UL << EXTI_E0CIDCFGR_SCID_Pos))   /*!< Enable CID filtering (static mode) and give pin control  to CID2 */
#define EXTI_LINE_CID_STATIC_3             (EXTI_LINE_ATTR_CID_STATIC_SELECT|(3UL << EXTI_E0CIDCFGR_SCID_Pos))   /*!< Enable CID filtering (static mode) and give pin control  to CID3 */


/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @defgroup EXTI_Private_Macros EXTI Private Macros
  * @{
  */
#if ! defined (STM32MP2XX_ASSY3_1_0 )
#if defined (CORE_CA35) || defined (CORE_CM33)
#define IS_EXTI_LINE(__LINE__)    ((IS_EXTI1_LINE(__LINE__)) || (IS_EXTI2_LINE(__LINE__)))
#else   /* CORE_CA35 || CORE_CM33 */
/* M0+ access only EXTI2 */
#define IS_EXTI_LINE(__LINE__)    (IS_EXTI2_LINE(__LINE__))
#endif  /* CORE_CA35 || CORE_CM33 */


/* remark: no GPIO on EXTI1 */
#define IS_EXTI1_LINE(__LINE__)         ( \
                                          (((__LINE__) & EXTI_INDEX ) == EXTI_EXTI1)                           \
                                          &&                                                                   \
                                          (  ((__LINE__) & ~(EXTI_PROPERTY_MASK | EXTI_EVENT_PRESENCE_MASK     \
                                                             | EXTI_INDEX_MASK | EXTI_PIN_MASK)                \
                                             ) == 0x00u                                                        \
                                          )                                                                    \
                                          &&                                                                   \
                                          ( \
                                            (((__LINE__) & EXTI_PROPERTY_MASK) == EXTI_DIRECT)   ||            \
                                            (((__LINE__) & EXTI_PROPERTY_MASK) == EXTI_CONFIG)   ||            \
                                            (((__LINE__) & EXTI_PROPERTY_MASK) == EXTI_GPIO)                   \
                                          )                                                                    \
                                          &&                                                                   \
                                          (((__LINE__) & EXTI_PIN_MASK)< EXTI1_LINE_NB)                        \
                                        )


#define IS_EXTI2_LINE(__LINE__)         ( \
                                          (((__LINE__) & EXTI_INDEX ) == EXTI_EXTI2)                           \
                                          &&                                                                   \
                                          (  ((__LINE__) & ~(EXTI_PROPERTY_MASK | EXTI_EVENT_PRESENCE_MASK |   \
                                                             EXTI_INDEX_MASK | EXTI_PIN_MASK)                  \
                                             ) == 0x00u                                                        \
                                          )                                                                    \
                                          &&                                                                   \
                                          ( \
                                            (((__LINE__) & EXTI_PROPERTY_MASK) == EXTI_DIRECT)   ||            \
                                            (((__LINE__) & EXTI_PROPERTY_MASK) == EXTI_CONFIG)   ||            \
                                            (((__LINE__) & EXTI_PROPERTY_MASK) == EXTI_GPIO)                   \
                                          )                                                                    \
                                          &&                                                                   \
                                          (((__LINE__) & EXTI_PIN_MASK) < EXTI2_LINE_NB)                       \
                                        )


#define IS_EXTI_MODE(__MODE__)          ((((__MODE__) & EXTI_MODE_MASK) != 0x00u) && \
                                         (((__MODE__) & ~EXTI_MODE_MASK) == 0x00u))

#define IS_EXTI_TRIGGER(__TRIGGER__)    (((__TRIGGER__) & ~EXTI_TRIGGER_MASK) == 0x00u)
#define IS_EXTI_PENDING_EDGE(__EDGE__) (((__EDGE__) == EXTI_TRIGGER_RISING) || \
                                        ((__EDGE__) == EXTI_TRIGGER_FALLING)|| \
                                        ((__EDGE__) == EXTI_TRIGGER_RISING_FALLING) )

