zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_exti.h
#define IS_EXTI_CONFIG_LINE(__LINE__)   (((__LINE__) & EXTI_CONFIG) != 0x00u)

#define IS_EXTI_GPIO_LINE(__LINE__)     (((__LINE__) & EXTI_GPIO) == EXTI_GPIO)

#define IS_EXTI_EVENT_PRESENT(__LINE__) (((__LINE__) & EXTI_EVENT) != 0x00u)

#define EXTI_GET_PIN(__LINE__)          ( (__LINE__) & EXTI_PIN_MASK)

#if defined(STM32MP21xxxx)
#define EXTI1_GPIO_PORT_NB                (10)
#else
#define EXTI1_GPIO_PORT_NB                (12)
#endif

#if defined(STM32MP21xxxx)
#define IS_EXTI1_GPIO_PORT(__PORT__)     (((__PORT__) == EXTI_GPIOA) || \
                                          ((__PORT__) == EXTI_GPIOB) || \
                                          ((__PORT__) == EXTI_GPIOC) || \
                                          ((__PORT__) == EXTI_GPIOD) || \
                                          ((__PORT__) == EXTI_GPIOE) || \
                                          ((__PORT__) == EXTI_GPIOF) || \
                                          ((__PORT__) == EXTI_GPIOG) || \
                                          ((__PORT__) == EXTI_GPIOH) || \
                                          ((__PORT__) == EXTI_GPIOI) || \
                                          ((__PORT__) == EXTI_GPIOZ))
#else
#define IS_EXTI1_GPIO_PORT(__PORT__)     (((__PORT__) == EXTI_GPIOA) || \
                                          ((__PORT__) == EXTI_GPIOB) || \
                                          ((__PORT__) == EXTI_GPIOC) || \
                                          ((__PORT__) == EXTI_GPIOD) || \
                                          ((__PORT__) == EXTI_GPIOE) || \
                                          ((__PORT__) == EXTI_GPIOF) || \
                                          ((__PORT__) == EXTI_GPIOG) || \
                                          ((__PORT__) == EXTI_GPIOH) || \
                                          ((__PORT__) == EXTI_GPIOI) || \
                                          ((__PORT__) == EXTI_GPIOJ) || \
                                          ((__PORT__) == EXTI_GPIOK) || \
                                          ((__PORT__) == EXTI_GPIOZ))
#endif

#if defined (CORE_CA35) || defined (CORE_CM33)
#if defined(STM32MP21xxxx)
#define EXTI2_GPIO_PORT_NB                (10)
#else
#define EXTI2_GPIO_PORT_NB                (12)
#endif

#if defined(STM32MP21xxxx)
#define IS_EXTI2_GPIO_PORT(__PORT__)     (((__PORT__) == EXTI_GPIOA) || \
                                          ((__PORT__) == EXTI_GPIOB) || \
                                          ((__PORT__) == EXTI_GPIOC) || \
                                          ((__PORT__) == EXTI_GPIOD) || \
                                          ((__PORT__) == EXTI_GPIOE) || \
                                          ((__PORT__) == EXTI_GPIOF) || \
                                          ((__PORT__) == EXTI_GPIOG) || \
                                          ((__PORT__) == EXTI_GPIOH) || \
                                          ((__PORT__) == EXTI_GPIOI) || \
                                          ((__PORT__) == EXTI_GPIOZ))
#else
#define IS_EXTI2_GPIO_PORT(__PORT__)     (((__PORT__) == EXTI_GPIOA) || \
                                          ((__PORT__) == EXTI_GPIOB) || \
                                          ((__PORT__) == EXTI_GPIOC) || \
                                          ((__PORT__) == EXTI_GPIOD) || \
                                          ((__PORT__) == EXTI_GPIOE) || \
                                          ((__PORT__) == EXTI_GPIOF) || \
                                          ((__PORT__) == EXTI_GPIOG) || \
                                          ((__PORT__) == EXTI_GPIOH) || \
                                          ((__PORT__) == EXTI_GPIOI) || \
                                          ((__PORT__) == EXTI_GPIOJ) || \
                                          ((__PORT__) == EXTI_GPIOK) || \
                                          ((__PORT__) == EXTI_GPIOZ))
#endif
#else   /* CORE_CA35 || CORE_CM33 */

#define EXTI2_GPIO_PORT_NB                (1)

#define IS_EXTI2_GPIO_PORT(__PORT__)     ((__PORT__) == EXTI_GPIOZ)
#endif  /* CORE_CA35 || CORE_CM33 */

#if defined (CORE_CA35) || defined (CORE_CM33)
#define IS_EXTI_GPIO_PORT(__INSTANCE__, __PORT__)                 \
  ((((__INSTANCE__) == EXTI1) && IS_EXTI1_GPIO_PORT(__PORT__))  \
   ||                                                       \
   ((((__INSTANCE__) == EXTI2) && IS_EXTI2_GPIO_PORT(__PORT__))))
#else   /* CORE_CA35 || CORE_CM33 */
#define IS_EXTI_GPIO_PORT(__INSTANCE__, __PORT__)     (((__INSTANCE__) == EXTI2) && (__PORT__) == EXTI_GPIOZ)
#endif  /* CORE_CA35 || CORE_CM33 */

#define IS_EXTI1_GPIO_PIN(__PIN__)      ((__PIN__) < EXTI1_GPIO_PIN_MAX)

#define IS_EXTI2_GPIO_PIN(__PIN__)      ((__PIN__) < EXTI2_GPIO_PIN_MAX)

#if defined (CORE_CA35) || defined (CORE_CM33)
#define IS_EXTI_GPIO_PIN(__INSTANCE__, __PIN__)                 \
  ((((__INSTANCE__) == EXTI1) && IS_EXTI1_GPIO_PIN(__PIN__))  \
   ||                                                       \
   ((((__INSTANCE__) == EXTI2) && IS_EXTI2_GPIO_PIN(__PIN__))))
#else   /* CORE_CA35 || CORE_CM33 */
#define IS_EXTI_GPIO_PIN(__INSTANCE__, __PIN__)      (((__INSTANCE__) == EXTI2) && (__PIN__) < EXTI2_GPIO_PIN_MAX)
#endif  /* CORE_CA35 || CORE_CM33 */
#else   /* !defined (STM32MP2XX_ASSY3_1_0 ) */
#if defined (CORE_CA35) || defined (CORE_CM33)
#define IS_EXTI_LINE(__LINE__)    ((IS_EXTI1_LINE(__LINE__)) || (IS_EXTI2_LINE(__LINE__)))
#else   /* CORE_CA35 || CORE_CM33 */
/* M0+ access only EXTI2 */
#define IS_EXTI_LINE(__LINE__)    (IS_EXTI2_LINE(__LINE__))
#endif  /* CORE_CA35 || CORE_CM33 */


/* remark: no GPIO on EXTI1 */
#define IS_EXTI1_LINE(__LINE__)         ( \
                                          (((__LINE__) & EXTI_INDEX ) == EXTI_EXTI1)                          \
                                          &&                                                                  \
                                          (  ((__LINE__) & ~(EXTI_PROPERTY_MASK | EXTI_EVENT_PRESENCE_MASK |  \
                                                             EXTI_INDEX_MASK | EXTI_PIN_MASK)                 \
                                             ) == 0x00u                                                       \
                                          )                                                                   \
                                          &&                                                                  \
                                          ( \
                                            (((__LINE__) & EXTI_PROPERTY_MASK) == EXTI_DIRECT) ||             \
                                            (((__LINE__) & EXTI_PROPERTY_MASK) == EXTI_CONFIG)                \
                                          )                                                                   \
                                          &&                                                                  \
                                          (((__LINE__) & EXTI_PIN_MASK) < EXTI1_LINE_NB)                      \
                                        )


#define IS_EXTI2_LINE(__LINE__)         ( \
                                          (((__LINE__) & EXTI_INDEX ) == EXTI_EXTI2)                          \
                                          &&                                                                  \
                                          (  ((__LINE__) & ~(EXTI_PROPERTY_MASK | EXTI_EVENT_PRESENCE_MASK |  \
                                                             EXTI_INDEX_MASK  | EXTI_PIN_MASK)                \
                                             ) == 0x00u                                                       \
                                          )                                                                   \
                                          &&                                                                  \
                                          ( \
                                            (((__LINE__) & EXTI_PROPERTY_MASK) == EXTI_DIRECT) ||             \
                                            (((__LINE__) & EXTI_PROPERTY_MASK) == EXTI_CONFIG) ||             \
                                            (((__LINE__) & EXTI_PROPERTY_MASK) == EXTI_GPIO)                  \
                                          )                                                                   \
                                          &&                                                                  \
                                          (((__LINE__) & EXTI_PIN_MASK) < EXTI2_LINE_NB)                      \
                                        )


#define IS_EXTI_MODE(__MODE__)          ((((__MODE__) & EXTI_MODE_MASK) != 0x00u) && \
                                         (((__MODE__) & ~EXTI_MODE_MASK) == 0x00u))

#define IS_EXTI_TRIGGER(__TRIGGER__)    (((__TRIGGER__) & ~EXTI_TRIGGER_MASK) == 0x00u)
#define IS_EXTI_PENDING_EDGE(__EDGE__) (((__EDGE__) == EXTI_TRIGGER_RISING) || \
                                        ((__EDGE__) == EXTI_TRIGGER_FALLING)|| \
                                        ((__EDGE__) == EXTI_TRIGGER_RISING_FALLING) )

