zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_exti.h
#define IS_EXTI_CONFIG_LINE(__LINE__)   (((__LINE__) & EXTI_CONFIG) != 0x00u)

#define IS_EXTI_GPIO_LINE(__LINE__)     (((__LINE__) & EXTI_GPIO) == EXTI_GPIO)

#define IS_EXTI_EVENT_PRESENT(__LINE__) (((__LINE__) & EXTI_EVENT) != 0x00u)

#define EXTI_GET_PIN(__LINE__)          ( (__LINE__) & EXTI_PIN_MASK)


/* remark: no GPIO on EXTI1 */
#define EXTI1_GPIO_PORT_NB                (0)

/* always return false */
#define IS_EXTI1_GPIO_PORT(__PORT__)      (1<0)

#if defined (CORE_CA35) || defined (CORE_CM33)
#if defined(STM32MP21xxxx)
#define EXTI2_GPIO_PORT_NB                (10)
#else
#define EXTI2_GPIO_PORT_NB                (12)
#endif
#if defined(STM32MP21xxxx)
#define IS_EXTI2_GPIO_PORT(__PORT__)     (((__PORT__) == EXTI_GPIOA) || \
                                          ((__PORT__) == EXTI_GPIOB) || \
                                          ((__PORT__) == EXTI_GPIOC) || \
                                          ((__PORT__) == EXTI_GPIOD) || \
                                          ((__PORT__) == EXTI_GPIOE) || \
                                          ((__PORT__) == EXTI_GPIOF) || \
                                          ((__PORT__) == EXTI_GPIOG) || \
                                          ((__PORT__) == EXTI_GPIOH) || \
                                          ((__PORT__) == EXTI_GPIOI) || \
                                          ((__PORT__) == EXTI_GPIOZ))
#else
#define IS_EXTI2_GPIO_PORT(__PORT__)     (((__PORT__) == EXTI_GPIOA) || \
                                          ((__PORT__) == EXTI_GPIOB) || \
                                          ((__PORT__) == EXTI_GPIOC) || \
                                          ((__PORT__) == EXTI_GPIOD) || \
                                          ((__PORT__) == EXTI_GPIOE) || \
                                          ((__PORT__) == EXTI_GPIOF) || \
                                          ((__PORT__) == EXTI_GPIOG) || \
                                          ((__PORT__) == EXTI_GPIOH) || \
                                          ((__PORT__) == EXTI_GPIOI) || \
                                          ((__PORT__) == EXTI_GPIOJ) || \
                                          ((__PORT__) == EXTI_GPIOK) || \
                                          ((__PORT__) == EXTI_GPIOZ))
#endif
#else   /* CORE_CA35 || CORE_CM33 */

#define EXTI2_GPIO_PORT_NB                (1)

#define IS_EXTI2_GPIO_PORT(__PORT__)     ((__PORT__) == EXTI_GPIOZ)
#endif  /* CORE_CA35 || CORE_CM33 */

#if defined (CORE_CA35) || defined (CORE_CM33)
#define IS_EXTI_GPIO_PORT(__INSTANCE__, __PORT__)                 \
  ((((__INSTANCE__) == EXTI1) && IS_EXTI1_GPIO_PORT(__PORT__))  \
   ||                                                       \
   ((((__INSTANCE__) == EXTI2) && IS_EXTI2_GPIO_PORT(__PORT__))))
#else   /* CORE_CA35 || CORE_CM33 */
#define IS_EXTI_GPIO_PORT(__INSTANCE__, __PORT__)     (((__INSTANCE__) == EXTI2) && (__PORT__) == EXTI_GPIOZ)
#endif  /* CORE_CA35 || CORE_CM33 */

#define IS_EXTI1_GPIO_PIN(__PIN__)      (1<0)

#define IS_EXTI2_GPIO_PIN(__PIN__)      ((__PIN__) < EXTI2_GPIO_PIN_MAX)

#if defined (CORE_CA35) || defined (CORE_CM33)
#define IS_EXTI_GPIO_PIN(__INSTANCE__, __PIN__)                 \
  ((((__INSTANCE__) == EXTI1) && IS_EXTI1_GPIO_PIN(__PIN__))  \
   ||                                                       \
   ((((__INSTANCE__) == EXTI2) && IS_EXTI2_GPIO_PIN(__PIN__))))
#else   /* CORE_CA35 || CORE_CM33 */
#define IS_EXTI_GPIO_PIN(__INSTANCE__, __PIN__)      (((__INSTANCE__) == EXTI2) && (__PIN__) < EXTI2_GPIO_PIN_MAX)
#endif  /* CORE_CA35 || CORE_CM33 */
#endif  /* !defined (STM32MP2XX_ASSY3_1_0 ) */

#if defined (CORTEX_IN_SECURE_STATE)
#define IS_EXTI_LINE_ATTRIBUTES(__ATTRIBUTES__)   ( \
                                                    (((__ATTRIBUTES__)&EXTI_LINE_ATTR_CID_STATIC_SELECT ) ==   \
                                                     EXTI_LINE_ATTR_CID_STATIC_SELECT                   )      \
                                                    ||                                                         \
                                                    (((__ATTRIBUTES__)&EXTI_LINE_CID_DISABLE            ) ==   \
                                                     EXTI_LINE_CID_DISABLE                              )      \
                                                    ||                                                         \
                                                    (((__ATTRIBUTES__)&EXTI_LINE_ATTR_SEC_SELECT        ) ==   \
                                                     EXTI_LINE_ATTR_SEC_SELECT                          )      \
                                                    ||                                                         \
                                                    (((__ATTRIBUTES__)&EXTI_LINE_ATTR_PRIV_SELECT       ) ==   \
                                                     EXTI_LINE_ATTR_PRIV_SELECT                         )      \
                                                  )
#else   /* CORTEX_IN_SECURE_STATE */
#define IS_EXTI_LINE_ATTRIBUTES(__ATTRIBUTES__)   ( \
                                                    (((__ATTRIBUTES__)&EXTI_LINE_ATTR_CID_STATIC_SELECT ) ==   \
                                                     EXTI_LINE_ATTR_CID_STATIC_SELECT                   )      \
                                                    ||                                                         \
                                                    (((__ATTRIBUTES__)&EXTI_LINE_CID_DISABLE            ) ==   \
                                                     EXTI_LINE_CID_DISABLE                              )      \
                                                    ||                                                         \
                                                    (((__ATTRIBUTES__)&EXTI_LINE_ATTR_PRIV_SELECT       ) ==   \
                                                     EXTI_LINE_ATTR_PRIV_SELECT                         )      \
                                                  )
#endif  /* CORTEX_IN_SECURE_STATE */
/**
  * @}
  */


/* Exported functions --------------------------------------------------------*/
/** @defgroup EXTI_Exported_Functions EXTI Exported Functions
  * @brief    EXTI Exported Functions
  * @{
  */

/** @defgroup EXTI_Exported_Functions_Group1 Configuration functions
  * @brief    Configuration functions
  * @{
  */
/* Configuration functions ****************************************************/
HAL_StatusTypeDef HAL_EXTI_SetConfigLine(EXTI_HandleTypeDef *hexti, const EXTI_ConfigTypeDef *pExtiConfig);
HAL_StatusTypeDef HAL_EXTI_GetConfigLine(EXTI_HandleTypeDef *hexti, EXTI_ConfigTypeDef *pExtiConfig);
HAL_StatusTypeDef HAL_EXTI_ClearConfigLine(EXTI_HandleTypeDef *hexti);
HAL_StatusTypeDef HAL_EXTI_RegisterCallback(EXTI_HandleTypeDef *hexti, EXTI_CallbackIDTypeDef CallbackID,
                                            void (*pPendingCbfn)(void));
HAL_StatusTypeDef HAL_EXTI_GetHandle(EXTI_HandleTypeDef *hexti, uint32_t ExtiLine);
/**
  * @}
  */

/** @defgroup EXTI_Exported_Functions_Group2 IO operation functions
  * @brief    IO operation functions
  * @{
  */
/* IO operation functions *****************************************************/
void              HAL_EXTI_IRQHandler(EXTI_HandleTypeDef *hexti);
uint32_t          HAL_EXTI_GetPending(const EXTI_HandleTypeDef *hexti, uint32_t Edge);
void              HAL_EXTI_ClearPending(EXTI_HandleTypeDef *hexti, uint32_t Edge);
void              HAL_EXTI_GenerateSWI(const EXTI_HandleTypeDef *hexti);

/**
  * @}
  */

/* Register Access control  functions  *******************************************/
/** @defgroup EXTI_Exported_Functions_Group3 Register Access control functions
  * @{
  */
void              HAL_EXTI_ConfigLineAttributes(uint32_t ExtiLine, uint32_t LineAttributes);
HAL_StatusTypeDef HAL_EXTI_GetConfigLineAttributes(uint32_t ExtiLine, uint32_t *pLineAttributes);

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32MP2xx_HAL_EXTI_H */
